app/views/user_overview/index.html.haml

          = t.test.title
      -if t.test.questions.any?
        .test-progress-bar{'data-progress' => "#{t.percent_completed}%"}
---
SELECT `user_tests`.* FROM `user_tests` WHERE `user_tests`.`user_id` = 1