app/controllers/tests_controller.rb

  def process_enrol
    @test_code = params[:test_code]
    @current_test = Test.find_by_test_code(@test_code)
---
SELECT  `tests`.* FROM `tests` WHERE `tests`.`test_code` = 'Math' LIMIT 1