app/controllers/user_overview_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `user_tests`.* FROM `user_tests` WHERE `user_tests`.`user_id` = 1
---
  def index
    user = User.find(current_user)
    @tests = user.user_tests
    @first_name = user.first_name